In [1]:
import pandas as pd
import numpy as np

data = {
    'Name': ['Ajay', 'Abhishek', 'Joshi', 'Bora'],
    'Age': [23, 35, 45, 28],
    'Score': [88.5, 92.3, 79.0, 85.4],
    'Passed': [True, True, False, True]
}

new_df = pd.DataFrame(data)
new_df

       Name  Age  Score  Passed
0      Ajay   23   88.5    True
1  Abhishek   35   92.3    True
2     Joshi   45   79.0   False
3      Bora   28   85.4    True

In [9]:
new_df.to_csv("new_dataset.csv", index=False)

In [11]:
!ls

anaconda3	    Desktop    examples.desktop  Pictures     Untitled1.ipynb
anaconda_projects   Documents  Iris.csv		 snap	      Untitled2.ipynb
bsiotr_dataset	    Downloads  new_dataset.csv	 task1.ipynb  Untitled.ipynb
bsiotr-dsbda-8.zip  eclipse    nltk_data	 Templates    Videos